In [96]:
import pandas as pd

In [128]:
# Python code demonstrate creating 

import pandas as pd

# initialise data of lists.
fruitList = {'Fruits':[ 'Apple' , 'Banana' , 'Mango', 'Orange' ],
		'Quantity':[ 50 , 20 , 60 , 40 ],
         'Price':[ 100 , 60 , 200 , 80 ]}

# Create DataFrame
df = pd.DataFrame(fruitList)

# Print the output.
df

   Fruits  Quantity  Price
0   Apple        50    100
1  Banana        20     60
2   Mango        60    200
3  Orange        40     80

In [98]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [99]:
# The initial set of names and age
names = [ 'John' , 'Jack' , 'Sam' , 'Ray' ]
age = [ 23 , 24 , 25 , 26 ]

DataSet = list(zip(names, age))
DataSet

[('John', 23), ('Jack', 24), ('Sam', 25), ('Ray', 26)]

In [100]:
df1 = pd.DataFrame(data=DataSet, columns=['name', 'age'])
df1.head()

   name  age
0  John   23
1  Jack   24
2   Sam   25
3   Ray   26

In [101]:
df1.columns

Index(['name', 'age'], dtype='object')

In [102]:
df1.shape?

Type:        property
String form: <property object at 0x12c2e6b60>
Docstring:
Return a tuple representing the dimensionality of the DataFrame.

See Also
--------
ndarray.shape : Tuple of array dimensions.

Examples
--------
>>> df = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})
>>> df.shape
(2, 2)

>>> df = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4],
...                    'col3': [5, 6]})
>>> df.shape
(2, 3)

In [103]:
df1.shape

(4, 2)

In [104]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

In [105]:
df1.describe()

             age
count   4.000000
mean   24.500000
std     1.290994
min    23.000000
25%    23.750000
50%    24.500000
75%    25.250000
max    26.000000

In [106]:
df1.describe(include='all')

        name        age
count      4   4.000000
unique     4        NaN
top     John        NaN
freq       1        NaN
mean     NaN  24.500000
std      NaN   1.290994
min      NaN  23.000000
25%      NaN  23.750000
50%      NaN  24.500000
75%      NaN  25.250000
max      NaN  26.000000

In [107]:
df1.describe().T.style.background_gradient(cmap='coolwarm')

In [108]:
df1

   name  age
0  John   23
1  Jack   24
2   Sam   25
3   Ray   26

## Retrive values from DataFrame

In [109]:
print('max age', df1['age'].max())
print('3rd name in the list : ', df1.loc[2, 'name'])

max age 26
3rd name in the list :  Sam

In [110]:
df1.iloc[1]

name    Jack
age       24
Name: 1, dtype: object

In [111]:
df1[df1['age'] == 24]

   name  age
1  Jack   24

In [112]:
df1[df1.name == 'Sam']

  name  age
2  Sam   25

## Add new attribute

In [113]:
weight=[65,58,70,60]
df1['weight'] = weight
df1

   name  age  weight
0  John   23      65
1  Jack   24      58
2   Sam   25      70
3   Ray   26      60

In [114]:
salary = [50000, 75000, 40000, 80000]
df1['salary'] = salary
df1

   name  age  weight  salary
0  John   23      65   50000
1  Jack   24      58   75000
2   Sam   25      70   40000
3   Ray   26      60   80000

In [115]:
df1['AgeVsWeightRatio'] = df1['age']/df1['weight']
df1

   name  age  weight  salary  AgeVsWeightRatio
0  John   23      65   50000          0.353846
1  Jack   24      58   75000          0.413793
2   Sam   25      70   40000          0.357143
3   Ray   26      60   80000          0.433333

In [116]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   name              4 non-null      object
 1   age               4 non-null      int64
 2   weight            4 non-null      int64
 3   salary            4 non-null      int64
 4   AgeVsWeightRatio  4 non-null      float64
dtypes: float64(1), int64(3), object(1)
memory usage: 292.0+ bytes

In [117]:
df1.describe().T.style.background_gradient(cmap='coolwarm')

## Top and Bottom

In [118]:
df1.nlargest(2, 'age')

  name  age  weight  salary  AgeVsWeightRatio
3  Ray   26      60   80000          0.433333
2  Sam   25      70   40000          0.357143

In [119]:
df1.nsmallest(2, 'age')

   name  age  weight  salary  AgeVsWeightRatio
0  John   23      65   50000          0.353846
1  Jack   24      58   75000          0.413793

## Sorting

In [120]:
SortedAge = df1.sort_values(['age'], ascending=False)
SortedAge

   name  age  weight  salary  AgeVsWeightRatio
3   Ray   26      60   80000          0.433333
2   Sam   25      70   40000          0.357143
1  Jack   24      58   75000          0.413793
0  John   23      65   50000          0.353846

## altering values in Dataframe

In [121]:
df1.loc[df1['name'] == 'Sam', 'salary'] = 60000
df1

   name  age  weight  salary  AgeVsWeightRatio
0  John   23      65   50000          0.353846
1  Jack   24      58   75000          0.413793
2   Sam   25      70   60000          0.357143
3   Ray   26      60   80000          0.433333

In [122]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
           {'a': 100, 'b': 200, 'c': 300, 'd': 400},
           {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000}]
df2 = pd.DataFrame(mydict)
df2

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [123]:
df2.iloc[0]

a    1
b    2
c    3
d    4
Name: 0, dtype: int64

In [124]:
df2.iloc[[0]]

   a  b  c  d
0  1  2  3  4

### Pivot

In [138]:
pivot = df.pivot(columns='Fruits', values=['Price', 'Quantity'])
pivot

        Price                      Quantity
Fruits  Apple Banana  Mango Orange    Apple Banana Mango Orange
0       100.0    NaN    NaN    NaN     50.0    NaN   NaN    NaN
1         NaN   60.0    NaN    NaN      NaN   20.0   NaN    NaN
2         NaN    NaN  200.0    NaN      NaN    NaN  60.0    NaN
3         NaN    NaN    NaN   80.0      NaN    NaN   NaN   40.0

## https://www.geeksforgeeks.org/pandas-cheat-sheet/

## https://www.kaggle.com/discussions/getting-started/255139